; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v3 - type_3 ?v8 - type_1)
 	      (pred_2 ?v5 - object ?v8 - type_1)
	      (pred_1 ?v3 - type_3 ?v4 - type_2)
	      (pred_3 ?v3 - type_3 ?v5 - object ?v4 - type_2))

   (:action op_2
       :parameters  (?v3 - type_3 ?v6 ?v7 - type_1)
       :precondition (and  (pred_4 ?v3 ?v6))
       :effect (and  (pred_4 ?v3 ?v7)
		     (not (pred_4 ?v3 ?v6))))

   (:action op_1
       :parameters (?v3 - type_3 ?v2 - object ?v1 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v1) (pred_4 ?v3 ?v1) (pred_1 ?v3 ?v4))
       :effect (and (pred_3 ?v3 ?v2 ?v4)
		    (not (pred_2 ?v2 ?v1)) 
		    (not (pred_1 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_3 ?v2 - object ?v1 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v2 ?v4) (pred_4 ?v3 ?v1))
       :effect (and (pred_2 ?v2 ?v1)
		    (pred_1 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v2 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_07 obj_01 - type_2
obj_02 obj_09 obj_04 obj_03 - type_1
obj_05 obj_08 obj_10 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_1 obj_06 obj_07)
(pred_1 obj_06 obj_01)
(pred_2 obj_05 obj_03)
(pred_2 obj_08 obj_04)
(pred_2 obj_10 obj_02)
)
(:goal
(and
(pred_2 obj_05 obj_09)
(pred_2 obj_08 obj_02)
(pred_2 obj_10 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_06 ?b obj_01))))
)
)

; plan
1. (op_2 obj_06 obj_09 obj_02)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_02)
   goals met: 0 of 3
2. (op_1 obj_06 obj_10 obj_02 obj_07)
   deleted: (pred_2 obj_10 obj_02) (pred_1 obj_06 obj_07)
   added: (pred_3 obj_06 obj_10 obj_07)
   goals met: 0 of 3
3. (op_2 obj_06 obj_02 obj_03)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_03)
   goals met: 0 of 3
4. (op_3 obj_06 obj_10 obj_03 obj_07)
   deleted: (pred_3 obj_06 obj_10 obj_07)
   added: (pred_2 obj_10 obj_03) (pred_1 obj_06 obj_07)
   goals met: 1 of 3
5. (op_1 obj_06 obj_05 obj_03 obj_07)
   deleted: (pred_2 obj_05 obj_03) (pred_1 obj_06 obj_07)
   added: (pred_3 obj_06 obj_05 obj_07)
   goals met: 1 of 3
6. (op_2 obj_06 obj_03 obj_09)
   deleted: (pred_4 obj_06 obj_03)
   added: (pred_4 obj_06 obj_09)
   goals met: 1 of 3
7. (op_3 obj_06 obj_05 obj_09 obj_07)
   deleted: (pred_3 obj_06 obj_05 obj_07)
   added: (pred_2 obj_05 obj_09) (pred_1 obj_06 obj_07)
   goals met: 2 of 3
8. (op_2 obj_06 obj_09 obj_04)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_04)
   goals met: 2 of 3
9. (op_1 obj_06 obj_08 obj_04 obj_07)
   deleted: (pred_2 obj_08 obj_04) (pred_1 obj_06 obj_07)
   added: (pred_3 obj_06 obj_08 obj_07)
   goals met: 2 of 3
10. (op_2 obj_06 obj_04 obj_02)
   deleted: (pred_4 obj_06 obj_04)
   added: (pred_4 obj_06 obj_02)
   goals met: 2 of 3
11. (op_3 obj_06 obj_08 obj_02 obj_07)
   deleted: (pred_3 obj_06 obj_08 obj_07)
   added: (pred_2 obj_08 obj_02) (pred_1 obj_06 obj_07)
   goals met: 3 of 3
